Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Alternatively, if you want ``patchtest`` to iterate over and test multiple patches stored in a directory, you can use::
it_it: In alternativa, se si desidera che ``patchtest`` esegua un'iterazione e testi più patch memorizzate in una directory, è possibile utilizzare::

source: Alternatively, if you would like all of your Toaster related files and directories to be in a particular location other than the default, you can set the ``TOASTER_DIR`` environment variable, which takes precedence over your current working directory. Setting this environment variable causes Toaster to create and use ``$TOASTER_DIR./_toaster_clones``.
it_it: In alternativa, se si desidera che tutti i file e le directory relativi a Toaster si trovino in una posizione diversa da quella predefinita, è possibile impostare la variabile d'ambiente ``TOASTER_DIR``, che ha la precedenza sulla directory di lavoro corrente. Impostando questa variabile d'ambiente, Toaster crea e utilizza ``$TOASTER_DIR./_toaster_clones``.

source: Alternatively, if you would like all of your Toaster related files and directories to be in a particular location, you can set the ``TOASTER_DIR`` environment variable, which takes precedence over your current working directory. Setting this environment variable causes Toaster to use ``$TOASTER_DIR/build`` as the :term:`Build Directory`.
it_it: In alternativa, se si desidera che tutti i file e le directory relativi a Toaster si trovino in una posizione specifica, si può impostare la variabile d'ambiente ``TOASTER_DIR``, che ha la precedenza sulla directory di lavoro corrente. Impostando questa variabile d'ambiente, Toaster utilizzerà ``$TOASTER_DIR/build`` come :term:`Build Directory`.

source: Alternatively, you can source the ``init-build-env`` file provided by :doc:`bitbake-setup <bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup>`
it_it: In alternativa, è possibile caricare il file ``init-build-env`` fornito da :doc:`bitbake-setup <bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup>`

source: Although the files in the directory are empty of data, BitBake uses the filenames and timestamps for tracking purposes.
it_it: Sebbene i file nella directory siano vuoti, BitBake utilizza i nomi dei file e i timestamp a scopo di tracciamento.

source: Among other things, the script creates the :term:`Build Directory`, which is "build". After the script runs, your current working directory is set to the :term:`Build Directory`.
it_it: Tra le altre cose, lo script crea la :term:`Build Directory`, che è "build". Dopo l'esecuzione dello script, la directory di lavoro corrente verrà impostata su :term:`Build Directory`.

source: An Initial RAM Filesystem (:term:`Initramfs`) is an optionally compressed :wikipedia:`cpio <Cpio>` archive which is extracted by the Linux kernel into RAM in a special :wikipedia:`tmpfs <Tmpfs>` instance, used as the initial root filesystem.
it_it: Un filesystem in RAM iniziale (:term:`Initramfs`) è un archivio :wikipedia:`cpio <Cpio>`, eventualmente compresso, che viene estratto dal kernel Linux nella RAM in un'istanza speciale di :wikipedia:`tmpfs <Tmpfs>`, utilizzata come filesystem root iniziale.

source: An alternate scenario is when you create your own kernel recipe for the BSP. A good example of this is the Raspberry Pi BSP. If you examine the ``recipes-kernel/linux`` directory in that layer you see the following Raspberry Pi-specific recipes and associated files::
it_it: Un'alternativa è la creazione di una ricetta del kernel personalizzata per il BSP. Un buon esempio è il BSP per Raspberry Pi. Esaminando la directory ``recipes-kernel/linux`` in quel layer, si possono trovare le seguenti ricette specifiche per Raspberry Pi e i relativi file::

source: An amusing yet useful README (a tracing mini-How-to) can be found in ``/sys/kernel/debug/tracing/README``.
it_it: Un file README divertente ma utile (una mini-guida al tracing) si trova in ``/sys/kernel/debug/tracing/README``.

source: An example for the make-only installer::
it_it: Esempio per il programma di installazione solo make::

source: An image is an artifact of the BitBake build process given a collection of recipes and related Metadata. Images are the binary output that run on specific hardware or QEMU and are used for specific use-cases. For a list of the supported image types that the Yocto Project provides, see the ":ref:`ref-manual/images:Images`" chapter.
it_it: Una immagine [image] è un artefatto del processo di build di BitBake, data una raccolta di ricette e Metadati correlati. Le immagini sono l'output binario che viene eseguito su hardware specifico o su QEMU e sono utilizzate per casi d'uso specifici. Per un elenco dei tipi di immagine supportati da Yocto Project, consultare il capitolo ":ref:`ref-manual/images:Images`".

source: And at least one of the following:
it_it: E almeno uno dei seguenti:

source: And for the make-only installer::
it_it: E per l'installazione solo con make::

source: And look at the output (note here that we're using ``trace_pipe`` instead of trace to capture this trace --- this allows us to wait around on the pipe for data to appear)::
it_it: E osservare l'output (si noti che qui stiamo usando ``trace_pipe`` invece di trace per acquisire questa traccia: questo ci permette di attendere sulla pipe che i dati vengano visualizzati)::

source: And run blkparse on the host system using the device name::
it_it: Eseguire blkparse sul sistema host utilizzando il nome del dispositivo::

source: And then stop the trace after awhile or after running a particular workload that you want to trace::
it_it: Quindi, si interrompe la traccia dopo un po' di tempo o dopo aver eseguito un particolare carico di lavoro che si desidera tracciare::

source: And this turns off tracing for the specified device::
it_it: E questo disattiva il tracing per il dispositivo specificato::

source: And using ``perf report`` on the same file, we can see the call graphs from starting a few programs during those 30 seconds:
it_it: E usando ``perf report`` sullo stesso file, possiamo vedere i grafici delle chiamate dall'avvio di alcuni programmi durante quei 30 secondi:

source: Another area that plays a significant role in where source files come from is pointed to by the :term:`DL_DIR` variable. This area is a cache that can hold previously downloaded source. You can also instruct the OpenEmbedded build system to create tarballs from Git repositories, which is not the default behavior, and store them in the :term:`DL_DIR` by using the :term:`BB_GENERATE_MIRROR_TARBALLS` variable.
it_it: Un altro elemento che gioca un ruolo significativo nella provenienza dei file sorgente è indicato dalla variabile :term:`DL_DIR`. Questa area è una cache che può contenere il codice sorgente scaricato in precedenza. È anche possibile istruire il sistema di build OpenEmbedded a creare tarball dai repository Git, il che non è il comportamento di default, e a memorizzarli nella directory :term:`DL_DIR` utilizzando la variabile :term:`BB_GENERATE_MIRROR_TARBALLS`.

source: Another aspect of traditional profiling is that while powerful in many ways, it's limited by the granularity of the underlying data. Profiling tools offer various ways of sorting and presenting the sample data, which make it much more useful and amenable to user experimentation, but in the end it can't be used in an open-ended way to extract data that just isn't present as a consequence of the fact that conceptually, most of it has been thrown away.
it_it: Un altro aspetto della profilazione tradizionale è che, pur essendo potente sotto molti punti di vista, è limitata dalla granularità dei dati sottostanti. Gli strumenti di profilazione offrono vari modi per ordinare e presentare i dati di esempio, rendendoli molto più utili e adatti alla sperimentazione da parte dell'utente, ma in definitiva non possono essere utilizzati in modo aperto per estrarre dati che semplicemente non sono presenti, poiché concettualmente la maggior parte di essi viene scartata.

source: Another example of a patch that is specific to OpenEmbedded::
it_it: Un altro esempio di patch specifica per OpenEmbedded::

source: Another example that illustrates a layer is an application. Suppose you are creating an application that has library or other dependencies in order for it to compile and run. The layer, in this case, would be where all the recipes that define those dependencies are kept. The key point for a layer is that it is an isolated area that contains all the relevant information for the project that the OpenEmbedded build system knows about. For more information on layers, see the ":ref:`overview-manual/yp-intro:the yocto project layer model`" section in the Yocto Project Overview and Concepts Manual. You can also reference the ":ref:`dev-manual/layers:understanding and creating layers`" section in the Yocto Project Development Tasks Manual. For more information on BSP layers, see the ":ref:`bsp-manual/bsp:bsp layers`" section.
it_it: Un altro esempio che illustra un layer è un'applicazione. Supponiamo di creare un'applicazione che ha librerie o altre dipendenze necessarie per la compilazione e l'esecuzione. Il layer, in questo caso, sarebbe il luogo in cui sono memorizzate tutte le ricette che definiscono tali dipendenze. Il punto chiave di un layer è che si tratta di un'area isolata che contiene tutte le informazioni rilevanti per il progetto di cui il sistema di build OpenEmbedded è a conoscenza. Per ulteriori informazioni sui layer, consultare la sezione ":ref:`overview-manual/yp-intro:the yocto project layer model`" nel Manuale Introduttivo e Concetti di Yocto Project. È possibile fare riferimento anche alla sezione ":ref:`dev-manual/layers:understanding and creating layers`" nel Manuale di Sviluppo dei Task di Yocto Project. Per ulteriori informazioni sui layer BSP, consultare la sezione ":ref:`bsp-manual/bsp:bsp layers`".

source: Another form of fragment not to be confounded with Standard :term:`Configuration Fragments <Configuration Fragment>` are :term:`Built-in Fragments <Built-in Fragment>` which are used to assign a single variable value globally.
it_it: Un'altra tipologia di frammento da non confondere con i :term:`Configuration Fragment Standard<Configuration Fragment>` sono i :term:`Built-in Fragment <Built-in Fragment>`, utilizzati per assegnare un singolo valore a una variabile a livello globale.

source: Another place from which the build system can get source files is with :ref:`bitbake-user-manual/bitbake-user-manual-fetching:fetchers` employing various Source Control Managers (SCMs) such as Git or Subversion. In such cases, a repository is cloned or checked out. The :ref:`ref-tasks-fetch` task inside BitBake uses the :term:`SRC_URI` variable and the argument's prefix to determine the correct fetcher module.
it_it: Un'altra fonte da cui il sistema di build può ottenere i file sorgente è tramite :ref:`bitbake-user-manual/bitbake-user-manual-fetching:fetchers`, utilizzando diversi Source Control Managers (SCM) come Git o Subversion. In questi casi, un repository viene clonato o estratto. Il task :ref:`ref-tasks-fetch` all'interno di BitBake utilizza la variabile :term:`SRC_URI` e il prefisso dell'argomento per determinare il modulo fetcher corretto.

source: Another point worth noting is that historically within the Yocto Project, recipes were referred to as packages --- thus, the existence of several BitBake variables that are seemingly mis-named, (e.g. :term:`PR`, :term:`PV`, and :term:`PE`).
it_it: Un altro punto degno di nota è che storicamente, all'interno di Yocto Project, le ricette venivano chiamate pacchetti [package]; da qui l'esistenza di diverse variabili BitBake apparentemente denominate in modo errato (ad esempio, :term:`PR`, :term:`PV` e :term:`PE`).

source: Another problem results from the "run" scripts containing functions that might or might not get called. The incremental build solution contains code that figures out dependencies between shell functions. This code is used to prune the "run" scripts down to the minimum set, thereby alleviating this problem and making the "run" scripts much more readable as a bonus.
it_it: Un altro problema deriva dal fatto che gli script "run" contengono funzioni che potrebbero essere chiamate o meno. La soluzione di build incrementale include del codice che individua le dipendenze tra le funzioni di shell. Questo codice viene utilizzato per ridurre gli script "run" al minimo indispensabile, alleviando così questo problema e rendendo gli script "run" molto più leggibili.

source: Another report named ``<image-name>-<machine>.rootfs.sbom-cve-check.spdx.json`` is also generated: this is the enriched :term:`SPDX` file of the image containing the same information contained in the previous point, and a lot more metadata information on the packages included in the image. For more information on :term:`SPDX`, see the :doc:`/dev-manual/sbom` section of the Yocto Project Development Tasks Manual.
it_it: Viene generato anche un altro report denominato ``<image-name>-<machine>.rootfs.sbom-cve-check.spdx.json``: si tratta del file :term:`SPDX` arricchito dell'immagine, contenente le stesse informazioni del punto precedente e molte più informazioni sui metadati relativi ai pacchetti inclusi nell'immagine. Per ulteriori informazioni su :term:`SPDX`, consultare la sezione :doc:`/dev-manual/sbom` del Manuale di Sviluppo dei Task di Yocto Project.

source: Another way to look at it is that there are only so many ways that the 'primitive' counters can be used on their own to generate interesting output; to get anything more complicated than simple counts requires some amount of additional logic, which is typically specific to the problem at hand. For example, if we wanted to make use of a 'counter' that maps to the value of the time difference between when a process was scheduled to run on a processor and the time it actually ran, we wouldn't expect such a counter to exist on its own, but we could derive one called say ``wakeup_latency`` and use it to extract a useful view of that metric from trace data. Likewise, we really can't figure out from standard profiling tools how much data every process on the system reads and writes, along with how many of those reads and writes fail completely. If we have sufficient trace data, however, we could with the right tools easily extract and present that information, but we'd need something other than ready-made profiling tools to do that.
it_it: Un altro modo di vedere la cosa è che i contatori 'primitive' possono essere utilizzati solo in un numero limitato di modi per generare output interessanti; per ottenere qualcosa di più complesso di un semplice conteggio è necessaria una certa quantità di logica aggiuntiva, che in genere è specifica per il problema in questione. Ad esempio, se volessimo utilizzare un 'counter' che corrisponda al valore della differenza di tempo tra il momento in cui un processo è stato programmato per essere eseguito su un processore e il momento in cui è stato effettivamente eseguito, non ci aspetteremmo che un tale contatore esista di per sé, ma potremmo derivarne uno chiamato, ad esempio, ``wakeup_latency`` e usarlo per estrarre una visione utile di quella metrica dai dati di tracciamento. Allo stesso modo, non possiamo davvero capire con i normali strumenti di profilazione quanti dati ogni processo sul sistema legge e scrive, né quante di queste operazioni di lettura e scrittura falliscono completamente. Se disponessimo di dati di tracciamento sufficienti, con gli strumenti giusti potremmo facilmente estrarre e presentare tali informazioni, ma per farlo avremmo bisogno di qualcosa di diverso dai semplici strumenti di profilazione preconfezionati.

source: Any :term:`Metadata` usually found in a recipe can also be placed in a class file. Class files are identified by the extension ``.bbclass`` and are usually placed in one of the following subdirectories of a :term:`layer`:
it_it: Qualsiasi :term:`Metadata` che si trova solitamente in una ricetta può essere inserito anche in un file di classe. I file di classe sono identificati dall'estensione ``.bbclass`` e si trovano solitamente in una delle seguenti sottocartelle di un :term:`layer`:

source: Any required special licensing information. For example, this information includes information on special variables needed to satisfy a EULA, or instructions on information needed to build or distribute binaries built from the BSP Metadata.
it_it: Eventuali informazioni speciali relative alle licenze. Ad esempio, queste informazioni includono dettagli su variabili speciali necessarie per soddisfare un EULA (EULA, User License Agreement) o istruzioni su come compilare o distribuire i binari creati a partire dai metadati del BSP.

source: Anyway, you'll also be able to access the new messages on mailing list archives, either through a web browser, or for the lists archived on https://lore.kernel.org, through an individual newsgroup feed or a git repository.
it_it: In ogni caso, si potrà accedere ai nuovi messaggi negli archivi delle mailing list, tramite un browser web oppure, per le liste archiviate su https://lore.kernel.org, tramite un feed di newsgroup individuale o un repository Git.

source: Append files (``*.bbappend``) modify the main kernel recipe being used to build the image. The ``*.bb`` files would be a developer-supplied kernel recipe. This area of the BSP hierarchy can contain both these types of files although, in practice, it is likely that you would have one or the other.
it_it: I file di append (``*.bbappend``) modificano la ricetta principale del kernel utilizzata per la creazione dell'immagine. I file ``*.bb`` rappresentano una ricetta del kernel fornita dallo sviluppatore. Questa area della gerarchia del BSP può contenere entrambi i tipi di file, sebbene, in pratica, sia probabile che se ne trovi uno o l'altro.

source: Application Development SDK
it_it: SDK per lo Sviluppo di Applicazioni

source: Application Development and SDKs Manual
it_it: Manuale di Sviluppo di Applicazioni e degli SDK

source: Arbitrary groups of software Recipes. You use package groups to hold recipes that, when built, usually accomplish a single task. For example, a package group could contain the recipes for a company's proprietary or value-add software. Or, the package group could contain the recipes that enable graphics. A package group is really just another recipe. Because package group files are recipes, they end with the ``.bb`` filename extension.
it_it: Gruppi arbitrari di Ricette software. I "Package Group" [gruppi di pacchetti] vengono utilizzati per contenere ricette che, una volta compilate, solitamente svolgono una singola attività. Ad esempio, un gruppo di pacchetti potrebbe contenere le ricette per il software proprietario o a valore aggiunto di un'azienda. Oppure, il gruppo di pacchetti potrebbe contenere le ricette che abilitano la grafica. Un gruppo di pacchetti è essenzialmente un'altra ricetta. Poiché i file dei gruppi di pacchetti sono ricette, terminano con l'estensione ``.bb``.

source: Architecture of the Tracing and Profiling Tools
it_it: Architettura dei Tool di Tracing e Profilazione

source: Archived Components
it_it: Componenti Archiviati

source: Areas With Write Access
it_it: Aree con Accesso in Scrittura

source: As :ref:`ref-classes-sbom-cve-check` is an external tool, its implementation is detailed on the official documentation: https://sbom-cve-check.readthedocs.io/en/latest/index.html
it_it: Poiché :ref:`ref-classes-sbom-cve-check` è un tool esterno, la sua implementazione è descritta in dettaglio nella documentazione ufficiale: https://sbom-cve-check.readthedocs.io/en/latest/index.html

source: As :wikipedia:`GPG <GNU_Privacy_Guard>` is not part of the default :ref:`host requirements <ref-manual/system-requirements:Required Packages for the Build Host>`, you will need to install it on your host.
it_it: Poiché :wikipedia:`GPG <GNU_Privacy_Guard>` non fa parte dei requisiti :ref:`requisiti host <ref-manual/system-requirements:Required Packages for the Build Host>` di default, sarà necessario installarlo sull'host.

source: As a bit of background explanation for these call chains, think about what happens at a high level when you run ``wget`` to get a file out on the network. Basically what happens is that the data comes into the kernel via the network connection (socket) and is passed to the user space program ``wget`` (which is actually a part of BusyBox, but that's not important for now), which takes the buffers the kernel passes to it and writes it to a disk file to save it.
it_it: Per spiegare brevemente queste catene di chiamate, pensiamo a cosa succede a un livello generale quando si esegue ``wget`` per scaricare un file dalla rete. In pratica, i dati arrivano al kernel tramite la connessione di rete (socket) e vengono passati al programma in spazio utente ``wget`` (che in realtà fa parte di BusyBox, ma questo non è importante per ora), il quale prende i buffer che il kernel gli passa e li scrive su un file su disco per salvarli.

source: As a concrete example, we can trace all the events we think might be applicable to our workload::
it_it: A titolo di esempio concreto, possiamo tracciare tutti gli eventi che riteniamo pertinenti al nostro carico di lavoro::

source: As a real world example, the aim is when building an IPK-based image, only the :ref:`ref-tasks-package_write_ipk` tasks would have their shared state packages fetched and extracted. Since the sysroot is not used, it would never get extracted. This is another reason why a task-based approach is preferred over a recipe-based approach, which would have to install the output from every task.
it_it: Come esempio concreto, l'obiettivo è che, durante la creazione di un'immagine basata su IPK, solo i task :ref:`ref-tasks-package_write_ipk` abbiano i loro pacchetti di stato condivisi scaricati ed estratti. Poiché il sysroot non viene utilizzato, non verrà mai estratto. Questo è un altro motivo per cui un approccio basato sui task è preferibile a un approccio basato sulle ricette, che dovrebbe installare l'output di ogni singolo task.

source: As a segue into tracing, let's try another profile using a different counter, something other than the default ``cycles``.
it_it: Come introduzione al tracing [tracciamento], proviamo un altro profilo utilizzando un contatore diverso, diverso dal valore predefinito ``cycles``.

source: As a simple example, let's just replace the print statements in the function bodies with a simple function that does nothing but increment a per-event count. When the program is run against a perf.data file, each time a particular event is encountered, a tally is incremented for that event. For example:
it_it: A titolo di semplice esempio, sostituiamo le istruzioni print nei corpi delle funzioni con una semplice funzione che non fa altro che incrementare un contatore per ogni evento. Quando il programma viene eseguito su un file perf.data, ogni volta che viene rilevato un particolare evento, il contatore corrispondente viene incrementato. Ad esempio:
